// BSLLS:MissingVariablesDescription-off

Перем Значение;

&Асинх
Процедура УстановитьЗначениеАсинхронно(НовоеЗначение) Экспорт
	Приостановить(500);
	Значение = НовоеЗначение;
КонецПроцедуры

&Асинх
Процедура УстановитьЗначениеАсинхронноСОшибкой(НовоеЗначение) Экспорт
	ВызватьИсключение "Я ошибка";
КонецПроцедуры

Функция ПолучитьЗначение() Экспорт
	Возврат Значение;
КонецФункции

&Асинх
Функция ВозвращаетСамСебя() Экспорт
	Возврат ЭтотОбъект;
КонецФункции

&Желудь
&Асинх("ПользовательскийОбработчикНеПерехваченныхАсинхронныхИсключений")
Процедура ПриСозданииОбъекта()
	Значение = 123;
КонецПроцедуры
