#Использовать asserts
#Использовать autumn
#Использовать "."
#Использовать ".."

&Пластилин
Перем Поделка;

&Тест
&Изолированный
Процедура АсинхронныеМетодыРаботаютАсинхронно() Экспорт

	// Дано
	Желудь = Поделка.НайтиЖелудь("АсинхронныйЖелудь");

	// Когда
	Желудь.УстановитьЗначениеАсинхронно(100);

	// Тогда
	Ожидаем.Что(Желудь.ПолучитьЗначение(), "Значение не изменится синхронно").Равно(123);

	// Время паузы в фоновом задании + дополнительная задержка.
	Приостановить(500 + 200);

	// Тогда
	Ожидаем.Что(Желудь.ПолучитьЗначение()).Равно(100);

КонецПроцедуры

&Тест
&Изолированный
Процедура АсинхронныеМетодыВозвращаютОбещание() Экспорт

	// Дано
	Желудь = Поделка.НайтиЖелудь("АсинхронныйЖелудь");

	// Когда
	Результат = Желудь.ВозвращаетСамСебя();

	// Тогда
	Ожидаем.Что(Результат, "Асинхронный метод вернул обещание").ИмеетТип("Обещание");

КонецПроцедуры

&Тест
&Изолированный
Процедура ПользовательскиеОбработчикиНеПерехваченныхИсключенийРаботают() Экспорт

	// Дано
	Желудь = Поделка.НайтиЖелудь("АсинхронныйЖелудь");
	Обработчик = Поделка.НайтиЖелудь("ПользовательскийОбработчикНеПерехваченныхАсинхронныхИсключений");

	// Когда
	Желудь.УстановитьЗначениеАсинхронноСОшибкой(100);

	Приостановить(100);

	// Тогда
	Ожидаем.Что(Обработчик.Инфо.Описание)
		.Содержит("Я ошибка");

КонецПроцедуры
